/**
* name 
*/
module constants{
	export class GameInfo{
		constructor(){

		}

		public static info = "跑得快单机版,益阳规则\n"
			+ "      跟斗地主类似，又有些不同。\n"
			+ "      总共使用51张牌，去掉了大小王和一张2。\n"
			+ "      下家出的牌必须比上家大，除炸弹可以管其他所有牌型外，另外的都要遵循牌型相同，张数相同，点数更大。\n"
			+ "      每局红桃3先出，有大牌必须出，否则罚分。\n"
			+ "\n"
			+ "所有牌型\n"
			+ "      单张：任意一张牌\n"
			+ "      对：两张牌点相同的牌\n"
			+ "      连对：两对或两对以上相连的牌，如：5566\n"
			+ "      三带二：三张牌点相同的牌，带二张杂牌，如：55566、55567\n"
			+ "      飞机带翅膀：两个或两个以上相连的三带二，如5556663789, QQQKKK8899\n"
			+ "      顺子：五张或五张以上牌点连续的牌。例如：3456789,10JQKA等\n"
			+ "      炸弹：四张或四张以上牌点相同的牌\n"
			+ "\n"
			+ "TODO：\n"
			+ "      1 最后一手允许三带一或不带\n"
			+ "      2 增加AI出牌的逻辑处理\n"
			;
	}
}